## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 7 to add, 0 to change, 7 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                   NAME                                   |
|----------|--------------------------------------------------------------------------|
| recreate | `aws_iam_instance_profile.karpenter`                                     |
|          | `aws_iam_role_policy.karpenter_controller`                               |
|          | `aws_iam_role_policy_attachment.karpenter-cluster-cni`                   |
|          | `aws_iam_role_policy_attachment.karpenter-cluster-ecr`                   |
|          | `aws_iam_role_policy_attachment.karpenter-cluster-managed-instance-core` |
|          | `aws_iam_role_policy_attachment.karpenter-cluster-worker-node`           |
|          | `module.iam_assumable_role_karpenter.aws_iam_role.this[0]`               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_instance_profile.karpenter must be replaced
-/+ resource "aws_iam_instance_profile" "karpenter" {
      ~ arn         = "arn:aws:iam::239043911459:instance-profile/KarpenterNodeInstanceProfile-notification-canada-ca-staging-eks-cluster" -> (known after apply)
      ~ create_date = "2023-09-13T13:46:36Z" -> (known after apply)
      ~ id          = "KarpenterNodeInstanceProfile-notification-canada-ca-staging-eks-cluster" -> (known after apply)
      ~ name        = "KarpenterNodeInstanceProfile-notification-canada-ca-staging-eks-cluster" -> "KarpenterNodeInstanceProfile-karpenter-controller-eks" # forces replacement
      + name_prefix = (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
      ~ unique_id   = "AIPATPKBAT4RVBJJSJJFA" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.karpenter_controller must be replaced
-/+ resource "aws_iam_role_policy" "karpenter_controller" {
      ~ id     = "karpenter-controller-notification-canada-ca-staging-eks-cluster:karpenter-policy-notification-canada-ca-staging-eks-cluster" -> (known after apply)
        name   = "karpenter-policy-notification-canada-ca-staging-eks-cluster"
      ~ role   = "karpenter-controller-notification-canada-ca-staging-eks-cluster" -> "karpenter-controller-eks" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.karpenter-cluster-cni must be replaced
-/+ resource "aws_iam_role_policy_attachment" "karpenter-cluster-cni" {
      ~ id         = "karpenter-controller-notification-canada-ca-staging-eks-cluster-20230913134637476200000005" -> (known after apply)
      ~ role       = "karpenter-controller-notification-canada-ca-staging-eks-cluster" -> "karpenter-controller-eks" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.karpenter-cluster-ecr must be replaced
-/+ resource "aws_iam_role_policy_attachment" "karpenter-cluster-ecr" {
      ~ id         = "karpenter-controller-notification-canada-ca-staging-eks-cluster-20230913134637370000000002" -> (known after apply)
      ~ role       = "karpenter-controller-notification-canada-ca-staging-eks-cluster" -> "karpenter-controller-eks" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.karpenter-cluster-managed-instance-core must be replaced
-/+ resource "aws_iam_role_policy_attachment" "karpenter-cluster-managed-instance-core" {
      ~ id         = "karpenter-controller-notification-canada-ca-staging-eks-cluster-20230913134637448300000004" -> (known after apply)
      ~ role       = "karpenter-controller-notification-canada-ca-staging-eks-cluster" -> "karpenter-controller-eks" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.karpenter-cluster-worker-node must be replaced
-/+ resource "aws_iam_role_policy_attachment" "karpenter-cluster-worker-node" {
      ~ id         = "karpenter-controller-notification-canada-ca-staging-eks-cluster-20230913134637371900000003" -> (known after apply)
      ~ role       = "karpenter-controller-notification-canada-ca-staging-eks-cluster" -> "karpenter-controller-eks" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.iam_assumable_role_karpenter.aws_iam_role.this[0] must be replaced
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::239043911459:role/karpenter-controller-notification-canada-ca-staging-eks-cluster" -> (known after apply)
      ~ create_date           = "2023-09-13T13:46:36Z" -> (known after apply)
      ~ id                    = "karpenter-controller-notification-canada-ca-staging-eks-cluster" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          - "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
          - "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore",
        ] -> (known after apply)
      ~ name                  = "karpenter-controller-notification-canada-ca-staging-eks-cluster" -> "karpenter-controller-eks" # forces replacement
      + name_prefix           = (known after apply)
      ~ role_last_used        = [
          - {
              - last_used_date = ""
              - region         = ""
            },
        ] -> (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROATPKBAT4R63QVLTOXI" -> (known after apply)
        # (4 unchanged attributes hidden)

      - inline_policy {
          - name   = "karpenter-policy-notification-canada-ca-staging-eks-cluster" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "ssm:GetParameter",
                              - "iam:PassRole",
                              - "ec2:DescribeImages",
                              - "ec2:RunInstances",
                              - "ec2:DescribeSubnets",
                              - "ec2:DescribeSecurityGroups",
                              - "ec2:DescribeLaunchTemplates",
                              - "ec2:DescribeInstances",
                              - "ec2:DescribeInstanceTypes",
                              - "ec2:DescribeInstanceTypeOfferings",
                              - "ec2:DescribeAvailabilityZones",
                              - "ec2:DeleteLaunchTemplate",
                              - "ec2:CreateTags",
                              - "ec2:CreateLaunchTemplate",
                              - "ec2:CreateFleet",
                              - "ec2:TerminateInstances",
                              - "ec2:DescribeSpotPriceHistory",
                              - "pricing:GetProducts",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 7 to destroy.

Changes to Outputs:
  ~ karpenter_iam_role_arn     = "arn:aws:iam::239043911459:role/karpenter-controller-notification-canada-ca-staging-eks-cluster" -> (known after apply)
  ~ karpenter_instance_profile = "KarpenterNodeInstanceProfile-notification-canada-ca-staging-eks-cluster" -> "KarpenterNodeInstanceProfile-karpenter-controller-eks"

Warning: Argument is deprecated

  with aws_wafv2_web_acl.notification-canada-ca,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "notification-canada-ca":
   1: resource "aws_wafv2_web_acl" "notification-canada-ca" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
